modm-ext/archive-stmicro-svd/header_stm32h757aii6@m4.svd
      <register>
        <name>GINTMSK</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MMISM</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OTGINT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SOFM</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXFLVLM</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NPTXFEM</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GINAKEFFM</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GONAKEFFM</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ESUSPM</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USBSUSPM</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>USBRST</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ENUMDNEM</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ISOODRPM</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOPFM</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EPMISM</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IEPINT</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OEPINT</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IISOIXFRM</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PXFRM_IISOOXFRM</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FSUSPM</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RSTDEM</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PRTIM</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HCIM</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PTXFEM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPMINTM</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CIDSCHGM</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DISCINT</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRQIM</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUIM</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GRXSTSR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GRXSTSP</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EPNUM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>BCNT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>DPID</name>
            <bitOffset>15</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PKTSTS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GRXFSIZ</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RXFD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF0_HNPTXFSIZ</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HNPTXSTS</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GCCFG</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DCDET</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PDET</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SDET</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PS2DET</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PWRDWN</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BCDEN</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DCDEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PDEN</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SDEN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VBDEN</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CID</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PRODUCT_ID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GSNPSID</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GHWCFG1</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GHWCFG2</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GHWCFG3</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GLPMCFG</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LPMEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPMACK</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BESL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>REMWAKE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>L1SSEN</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BESLTHRS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>L1DSEN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPMRSP</name>
            <bitOffset>13</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SLPSTS</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>L1RSMOK</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPMCHIDX</name>
            <bitOffset>17</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>LPMRCNT</name>
            <bitOffset>21</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SNDLPM</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LPMRCNTSTS</name>
            <bitOffset>25</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>ENBESL</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GPWRDN</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADPMEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADPIF</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GDFIFOCFG</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>GADPCTL</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HPTXFSIZ</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>PTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.0</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.1</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.2</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.3</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.4</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.5</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.6</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.7</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.8</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.9</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.10</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.11</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.12</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.13</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIEPTXF.14</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>INEPTXSA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>INEPTXFD</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>USB2_OTG_FS</name>
      <baseAddress>0x40080000</baseAddress>
      <register>
        <name>GOTGCTL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SRQSCS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRQ</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VBVALOEN</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VBVALOVAL</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AVALOEN</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AVALOVAL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BVALOEN</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BVALOVAL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HNGSCS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HNPRQ</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HSHNPEN</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DHNPEN</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EHEN</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CIDSTS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBCT</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ASVLD</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BSESVLD</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OTGVER</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GOTGINT</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SEDET</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SRSSCHG</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HNSSCHG</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HNGDET</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADTOCHG</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBCDNE</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>GAHBCFG</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>GINT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HBSTLEN</name>
            <bitOffset>1</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DMAEN</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXFELVL</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PTXFELVL</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
